spec/railsapp/app/controllers/tests_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "avatar", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "test@example.org"], ["avatar", "1.jpg"], ["created_at", "2017-06-19 22:50:42.187371"], ["updated_at", "2017-06-19 22:50:42.187371"]]