spec/railsapp/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    Voltron.config.js.crop_image = view_context.image_path("19.jpg")
    @users = User.all

INSERT INTO "users" ("email", "avatar", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "eric@commercekitchen.com"], ["avatar", "4.jpg"], ["created_at", 2016-11-03 18:53:37 UTC], ["updated_at", 2016-11-03 18:53:37 UTC]]
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "updated_at" = ?, "avatar" = ? WHERE "users"."id" = ?  [["updated_at", 2016-11-04 19:40:08 UTC], ["avatar", "24.jpg"], ["id", 4]]
---
  def update
    if @user.update(user_params)